# **PANDAS LIBERARY**

In [1]:
import pandas as pd

# data structures in pandas
*1. dataframe(2 - dimentional)*  
*2. series(1 - dimentional) - ordered or labeled array of values*

In [ ]:
#s = pd.Series([1, 2, 3, 4, 5])
s = pd.Series([1, 2, 3, 4, 5] , index=['a', 'b', 'c', 'd', 'e'])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
df = pd.DataFrame({
    'name': ['John', 'Jane', 'Sue', 'Fred'],
    'age': [23, 29, 21, 18]
})
df

   name  age
0  John   23
1  Jane   29
2   Sue   21
3  Fred   18

In [ ]:
df.head(2) # first 2 rows

   name  age
0  John   23
1  Jane   29

In [ ]:
df.tail(2) # last 2 rows

   name  age
2   Sue   21
3  Fred   18

In [ ]:
df.describe() # summary statistics

             age
count   4.000000
mean   22.750000
std     4.645787
min    18.000000
25%    20.250000
50%    22.000000
75%    24.500000
max    29.000000

*iloc and loc is used to access rows and columns in a DataFrame. loc is label-based, while iloc is integer position based. This means that you can use loc to access rows and columns by their names, while iloc is used to access rows and columns by their integer positions.*

In [10]:
df.iloc[1] # row 1

name    Jane
age       29
Name: 1, dtype: object

*ways to handle missing and duplicate values*

In [ ]:
df.dropna() # drop rows with NaN values
df.fillna(0) # fill NaN values with 0
df.drop_duplicates() # drop duplicate rows

*inplace = true is used to make cahanges on the original dataframe*

In [11]:
df.rename(columns={'name': 'First Name', 'age': 'Age'} , inplace= True) # rename columns

In [ ]:
df.info() # get information about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  4 non-null      object
 1   Age         4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [ ]:
df['Age'] = df['Age'].astype(float) # change data type of columns to float

In [14]:
len(df) # number of rows

4

*lambda functions are primarily used for concise, inline data manipulation*  
*apply is use to apply the lambda function to the list of numbers.*

In [17]:
fx = lambda x: x/2
df['half_age'] = df['Age'].apply(fx)# create new column
df

  First Name   Age  half_age
0       John  23.0      11.5
1       Jane  29.0      14.5
2        Sue  21.0      10.5
3       Fred  18.0       9.0